Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Infinispan supports instrumentation of the server via OpenTelemetry. Having the `quarkus-opentelemetry` extension will propagate the traces from the Infinispan Client to the Server. This behavior can be disabled via the property `quarkus.infinispan-client.tracing.propagation.enabled`
ja_jp: InfinispanはOpenTelemetryによるサーバーのインスツルメンテーションをサポートしています。 `quarkus-opentelemetry` エクステンションを追加することで、Infinispan クライアントからサーバーにトレースが伝搬されます。この動作は、プロパティ `quarkus.infinispan-client.tracing.propagation.enabled` で無効にすることが出来ます。

source: Infinispan supports server tracing using OpenTelemetry. Starting from Infinispan 15.0, you need to configure tracing in the server's settings. To enable tracing in Dev Services, you need to add extra settings using the `quarkus.infinispan-client.devservices.config-files` property.
ja_jp: InfinispanはOpenTelemetryを使用したサーバトレースをサポートしています。 Infinispan 15.0 以降では、サーバーの設定でトレースを設定する必要があります。Dev Services でトレースを有効にするには、 `quarkus.infinispan-client.devservices.config-files` プロパティを使用して追加の設定を追加する必要があります。

source: Infix Notation Example
ja_jp: インフィックス表記の例

source: Information about how the Quarkus works
ja_jp: Quarkus の仕組みに関する情報

source: Information about the current endpoint method and class (no reflection required)
ja_jp: 現在のエンドポイントメソッドとクラスに関する情報 (反映は不要)

source: Information about the current endpoint method and class (requires reflection)
ja_jp: 現在のエンドポイントメソッドとクラスに関する情報 (リフレクションが必要)

source: Informative By Default
ja_jp: デフォルトでは情報提供のみ

source: Inheritance
ja_jp: 継承

source: Inheritance of metadata
ja_jp: メタデータの継承

source: Initial HTTP handshake ends with the 401 status for anonymous users. You can also redirect the handshake request on authorization failure with the `quarkus.websockets-next.server.security.auth-failure-redirect-url` configuration property.
ja_jp: 匿名ユーザーの場合、最初の HTTP ハンドシェイクは 401 ステータスで終了します。 `quarkus.websockets-next.server.security.auth-failure-redirect-url` 設定プロパティーを使用して、認可失敗時にハンドシェイクリクエストをリダイレクトすることもできます。

source: Initial Release
ja_jp: 初期リリース

source: Initial backoff interval (in nanosecond).
ja_jp: 最初のバックオフ間隔（ナノ秒単位）。

source: Initial position at which to set cursor when subscribing to a topic at first time.
ja_jp: 最初にトピックを購読するときにカーソルを設定する初期位置。

source: Initialising services
ja_jp: サービスの初期化

source: Initialization
ja_jp: 初期化

source: Initialization of `BigDecimal`
ja_jp: `BigDecimal` の初期化

source: Initialization tasks
ja_jp: 初期化タスク

source: Initialize Handlebars templating engine.
ja_jp: Handlebars テンプレートエンジンを初期化します。

source: Initialize OAuth2 GitHub provider with a Vert.x instance, and GitHub client id and secret properties.
ja_jp: Vert.x インスタンス、および GitHub のクライアント ID とシークレットプロパティーを使用して、OAuth2 GitHub プロバイダーを初期化します。

source: Initialize OAuth2 GitHub provider with an injected Vert.x instance, and GitHub client id and secret properties.
ja_jp: 注入された Vert.x インスタンス、および GitHub のクライアント ID とシークレットプロパティーを使用して、OAuth2 GitHub プロバイダーを初期化します。

source: Initialize a new Git repository: `git init -b main`.
ja_jp: 新しい Git リポジトリーを初期化します: `git init -b main`

source: Initialized and Constructor Injection Example
ja_jp: 初期化とコンストラクタのインジェクション例

source: Initializing the REST service
ja_jp: RESTサービスの初期化

source: Initially, you will have no credentials registered, and no current user:
ja_jp: 初期状態では、認証情報が登録されておらず、現在のユーザーもいません。

source: Initiate testing by asking ngrok to reserve a domain:
ja_jp: ngrok にドメインを予約するように要求することでテストを開始します。

source: Inject Flyway for named datasources
ja_jp: 名前の付いたデータソースへの Flyway の注入

source: Inject Flyway for named datasources using the Quarkus `FlywayDataSource` qualifier
ja_jp: Quarkus `FlywayDataSource` 修飾子を使用して、指定されたデータソースに Flyway を注入します。

source: Inject GitHub API REST client that is used to request user emails.
ja_jp: ユーザーメールの要求に使用される GitHub API REST クライアントを注入します。

source: Inject GitHub specific UserInfo representation.
ja_jp: GitHub 固有の UserInfo 表現を注入します。

source: Inject JAXB components
ja_jp: JAXB コンポーネントを注入する

source: Inject JWT as MP JSON Web Token (JWT)
ja_jp: MP JSON Web Token（JWT）としてJWTを注入

source: Inject JWT as MP JWT
ja_jp: MP JWTとして JWT をインジェクト

source: Inject JWT as MP JWT JsonWebToken
ja_jp: JWT を MP JWT JsonWebTokenとして注入

source: Inject Liquibase MongoDB for named clients using the Quarkus `LiquibaseMongodbClient` qualifier
ja_jp: Quarkus の `LiquibaseMongodbClient` 修飾子を使用して、名前付きクライアントに Liquibase MongoDB を注入します

source: Inject Liquibase for named datasources
ja_jp: 指定されたデータソースに Liquibase を注入する

source: Inject Liquibase for named datasources using the Quarkus `LiquibaseDataSource` qualifier
ja_jp: Quarkus `LiquibaseDataSource` 修飾子を使用して、指定されたデータソースに Liquibase を注入します。

source: Inject Tokens
ja_jp: トークンを注入する

source: Inject `@RequestScoped` beans into `HttpSecurityPolicy`
ja_jp: `@RequestScoped` Bean の `HttpSecurityPolicy` への挿入

source: Inject `ApiEchoServiceClient` REST client
ja_jp: `ApiEchoServiceClient` REST クライアントを注入します。

source: Inject `TenantConfigBean` which can be used to access all the current OIDC tenant configurations.
ja_jp: 現在のすべての OIDC テナント設定にアクセスするために使用できる `TenantConfigBean` を注入します。

source: Inject `TenantConfigBean`, which can be used to access all the current OIDC tenant configurations.
ja_jp: 現在のすべての OIDC テナント設定にアクセスするために使用できる `TenantConfigBean` を注入します。

source: Inject a Hibernate Search `SearchMapping`, which relies on the `EntityManagerFactory` under the hood. Applications with multiple persistence units can use the CDI qualifier `@io.quarkus.hibernate.orm.PersistenceUnit` to select the right one: see <<multiple-persistence-units-attaching-cdi>>.
ja_jp: Hibernate Search `SearchMapping` を注入します。 これは内部的には `EntityManagerFactory` に依存しています。 複数の永続ユニットを持つアプリケーションでは、CDI 修飾子 `@io.quarkus.hibernate.orm.PersistenceUnit` を使用して、適切に選択できます。詳細は <<multiple-persistence-units-attaching-cdi>> を参照してください。

source: Inject a Hibernate Search mapping, the main entry point to Hibernate Search APIs.
ja_jp: Hibernate Search API へのメインエントリーポイントである Hibernate Search マッピングを注入します。

source: Inject a Hibernate Search session, which relies on the `EntityManager` under the hood. Applications with multiple persistence units can use the CDI qualifier `@io.quarkus.hibernate.orm.PersistenceUnit` to select the right one: see <<multiple-persistence-units-attaching-cdi>>.
ja_jp: Hibernate Search セッションをインジェクションします。このセッションは内部で `EntityManager` に依存しています。複数の永続化ユニットを持つアプリケーションではCDI修飾子 `@io.quarkus.hibernate.orm.PersistenceUnit` を使用して正しいユニットを選択することができます: <<multiple-persistence-units-attaching-cdi>> を参照してください。

source: Inject a Hibernate Search session, which relies on the `EntityManager` under the hood. Applications with multiple persistence units can use the CDI qualifier `@io.quarkus.hibernate.orm.PersistenceUnit` to select the right one: see xref:multiple-persistence-units-attaching-cdi[CDI integration].
ja_jp: HibernateのSearchセッションを注入します。これは、フードの下の `EntityManager` に依存します。複数の永続化ユニットを持つアプリケーションは、CDI修飾子 `@io.quarkus.hibernate.orm.PersistenceUnit` を使って正しいものを選択することができます: xref:multiple-persistence-units-attaching-cdi[CDI統合] を参照。

source: Inject a Reactive Messaging `Emitter` to send messages to the `quote-requests` channel.
ja_jp: Reactive Messaging `Emitter` を注入して、 `quote-requests` チャンネルにメッセージを送信します。

source: Inject a `KafkaTransactions` which exposes a Mutiny API. It allows the integration with the Mutiny API exposed by Hibernate Reactive with Panache.
ja_jp: Mutiny API を公開する `KafkaTransactions` を注入します。これにより、Hibernate Reactive with Panache によって公開された Mutiny API との統合が可能になります。

source: Inject a `MutinyEmitter` which exposes a Mutiny API. It simplifies the integration with the Mutiny API exposed by Hibernate Reactive with Panache.
ja_jp: Mutiny API を公開する `MutinyEmitter` を注入します。これにより、Hibernate Reactive with Panache によって公開された Mutiny API との統合が簡素化されます。

source: Inject a bean provided by other extension.
ja_jp: 他のエクステンションで提供されているBeanをインジェクトします。

source: Inject a mock instead of the RemoteCache bean
ja_jp: RemoteCache Beanの代わりにモックを注入します。

source: Inject a preconfigured Keycloak Admin Client.
ja_jp: 事前設定されたKeycloak Admin Clientを注入します。

source: Inject a variant template with base path derived from the injected field - `src/main/resources/templates/item`.
ja_jp: 注入されたフィールドから派生したベースパスを持つバリアントテンプレートを注入します - `src/main/resources/templates/item`

source: Inject all beans matching the type `List<String>`.
ja_jp: `List<String>` という型にマッチするすべての Bean を注入します。

source: Inject an `Emitter<String>`
ja_jp: `Emitter<String>` を注入します。

source: Inject both the imperative and reactive data sources
ja_jp: 命令型と反応型の両方のデータソースをインジェクトします

source: Inject data sources
ja_jp: データソースの注入

source: Inject instances with the `@MailerName("aws")` qualifier for the `aws` configuration.
ja_jp: @MailerName("aws")` の修飾子で `aws` の設定のインスタンスを注入。

source: Inject instances with the `@MailerName("sendgrid")` qualifier for the `sendgrid` configuration.
ja_jp: `@MailerName("sendgrid")` の修飾子で `sendgrid` の設定のインスタンスを注入。

source: Inject instances without qualifier for the default configuration.
ja_jp: デフォルトの設定で修飾子なしでインスタンスを注入。

source: Inject mock clients
ja_jp: モッククライアントの注入

source: Inject named OidcClient and Tokens
ja_jp: 名前付き OidcClient とトークンの挿入

source: Inject named OidcClient and tokens
ja_jp: 名前の付いた OidcClient とトークンの注入

source: Inject the Event bus
ja_jp: イベントバスの注入

source: Inject the Flyway object if you want to use it directly
ja_jp: Flyway オブジェクトを直接使用する場合はインジェクトします。

source: Inject the Hibernate Reactive `SessionFactory`.
ja_jp: Hibernate Reactive `SessionFactory` を注入します。

source: Inject the Hibernate Reactive `Session`
ja_jp: Hibernate Reactive `Session` を注入します。

source: Inject the LiquibaseFactory object
ja_jp: LiquibaseFactory オブジェクトのインジェクション

source: Inject the MeterRegistry
ja_jp: MeterRegistry の挿入

source: Inject the Quarkus liquibase factory if you want to use the liquibase methods directly
ja_jp: Liquibaseメソッドを直接使用したい場合は、QuarkusのLiquibaseファクトリーをインジェクトします。

source: Inject the Reactive Redis client
ja_jp: Reactive Redisクライアントを注入

source: Inject the Redis synchronous client
ja_jp: Redis同期クライアントを注入

source: Inject the `CounterBean`
ja_jp: `CounterBean` の注入

source: Inject the `CriteriaBuilderFactory`
ja_jp: `CriteriaBuilderFactory` を注入

source: Inject the `EntityManager`
ja_jp: `EntityManager` を注入

source: Inject the `EntityViewManager`
ja_jp: `EntityViewManager` を注入

source: Inject the `GreetingResource` with CDI `@Inject`:
ja_jp: CDI `@Inject` で `GreetingResource` を注入してください。

source: Inject the `Mailer` object managed by Quarkus
ja_jp: Quarkusが管理する `Mailer` オブジェクトを注入

source: Inject the `RedisDataSource` in the constructor
ja_jp: コンストラクターに `RedisDataSource` を注入します。

source: Inject the `RemoteCache`
ja_jp: `RemoteCache` を注入します。

source: Inject the `TransactionManager` to be able to activate `setRollbackOnly` semantic.
ja_jp: `setRollbackOnly` のセマンティックを有効にするために、 `TransactionManager` をインジェクトします。

source: Inject the `csrfToken.html` as a `Template`.
ja_jp: `csrfToken.html` を `Template` として注入してください。

source: Inject the additional beans producer
ja_jp: 追加のBeanプロデューサーを投入

source: Inject the assistant as optional, it will only be present if a provider is added and configured.
ja_jp: アシスタントをオプションとして注入します。これはプロバイダーが追加され設定されている場合にのみ存在します。

source: Inject the books cache
ja_jp: 書籍キャッシュの注入

source: Inject the configuration
ja_jp: 設定の挿入

source: Inject the configured `Engine` instance.
ja_jp: 設定された `Engine` インスタンスを注入します。

source: Inject the connector for `ClientEndpoint`.
ja_jp: `ClientEndpoint` のコネクターを注入します。

source: Inject the connector.
ja_jp: コネクターを注入します。

source: Inject the current OIDC session.
ja_jp: 現在の OIDC セッションを注入します。

source: Inject the event bus. Alternatively you can use `vertx.eventBus()`.
ja_jp: イベントバスを注入します。あるいは、 `vertx.eventBus()` を使うこともできます。

source: Inject the in-memory connector in your test class, using the `@Connector` or `@Any` qualifier.
ja_jp: `@Connector` または `@Any` 修飾子を使用して、テストクラスに in-memory コネクターを注入します。

source: Inject the in-memory connector in your test class.
ja_jp: テストクラスにインメモリーコネクタ－を注入します。

source: Inject the reactive mailer. The class to import is `io.quarkus.mailer.reactive.ReactiveMailer`.
ja_jp: リアクティブmailerをインジェクトします。インポートされるクラスは `io.quarkus.mailer.reactive.ReactiveMailer` です。

source: Inject the server-side entry point for creating ``OutboundSseEvent``s.
ja_jp: ``OutboundSseEvent`` を作成するためのサーバー側エントリーポイントを挿入します。

source: Inject the service and configure its name. The name is used in the application configuration. If not specified then the field name is used instead: `hello` in this particular case.
ja_jp: サービスをインジェクトし、その名前を設定します。この名前は、アプリケーションの設定で使用されます。指定しない場合、フィールド名が代わりに使用されます : このケースでは `hello` です。

source: Inject the template with path `templates/item.html`.
ja_jp: パスが `templates/item.html` のテンプレートを注入します。

source: Inject the underlying `org.quartz.Scheduler` instance.
ja_jp: 基礎となる `org.quartz.Scheduler` インスタンスをインジェクトします。

source: Inject the virtual thread executor
ja_jp: 仮想スレッドエグゼキュータの注入

source: Inject tokens
ja_jp: トークンの注入

source: Inject your entity manager and have fun
ja_jp: エンティティマネージャーを注入して楽しみます。

source: Inject your session factory and have fun
ja_jp: セッションファクトリを注入して楽しもう

source: Injectable AWS Context Variables
ja_jp: 注入可能なAWSコンテキスト変数

source: Injected Localized Message Bundle Example
ja_jp: 注入されたローカライズされた Message Bundleの例

source: Injected `@Channel` streams are not subscribed to by default, so the flow of messages is controlled by the application code using reactive streams and Mutiny APIs. But for `@Incoming` methods, the flow of messages is controlled by the runtime.
ja_jp: 注入された `@Channel` ストリームはデフォルトではサブスクライブされないため、メッセージのフローはリアクティブストリームと Mutiny API を使用してアプリケーションコードによって制御されます。 ただし、`@Incoming` メソッドの場合、メッセージのフローはランタイムによって制御されます。

source: Injected in your beans via `@Inject`; e.g. `@Inject AppMessages`
ja_jp: `@Inject` であなたのBeanに注入されます。 例: `@Inject AppMessages`

source: Injected mail templates are validated during build. The build fails if there is no matching template in `src/main/resources/templates`.
ja_jp: 挿入されたメールテンプレートはビルド時に検証されます。 `src/main/resources/templates` に一致するテンプレートがない場合、ビルドは失敗します。

source: Injecting Beans Directly In Templates
ja_jp: テンプレートに直接Beansを注入

source: Injecting Configuration into Recorders
ja_jp: レコーダーへの設定の注入

source: Injecting Keycloak Admin Client instead of creating it directly in the application code is a simpler and more flexible option but you can create the same admin client manually if necessary:
ja_jp: アプリケーションコードで直接作成する代わりにKeycloak Admin Clientをインジェクトすることは、よりシンプルで柔軟なオプションですが、必要であれば同じAdmin Clientを手動で作成することができます:

source: Injecting Multiple Bean Instances Intuitively
ja_jp: 複数の Bean インスタンスを直感的に注入する

source: Injecting `@Channel("prices")` or having `@Incoming("prices")` does not automatically configure the application to consume messages from Kafka. You need to configure an inbound connector with `mp.messaging.incoming.prices\...` or have an `@Outgoing("prices")` method somewhere in your application (in which case, `prices` will be an in-memory channel).
ja_jp: `@Channel("prices")` を注入したり、 `@Incoming("prices")` を持っていたりしても、Kafka からのメッセージを消費するようにアプリケーションが自動的に設定されるわけではありません。 `mp.messaging.incoming.prices\...` を使用してインバウンドコネクターを設定するか、アプリケーションのどこかに `@Outgoing("prices")` メソッドを持っている必要があります (その場合、 `prices` はインメモリーチャネルになります)。

source: Injecting a Logger
ja_jp: Loggerの挿入

source: Injecting a URI
ja_jp: URI の挿入

source: Injecting a `Cache` with the `@CacheName` annotation
ja_jp: `@CacheName` アノテーションとともに `Cache` をインジェクトする

source: Injecting a configured logger
ja_jp: 設定されたロガーの注入

source: Injecting all beans of a particular type is limited to `List<Bean>`. Injecting `Set<Bean>` or `Map<String, Bean>` is not supported.
ja_jp: 特定のタイプのすべての Bean を注入することは、 `List<Bean>` に限定されます。 `Set<Bean>` や `Map<String, Bean>` を注入することは、サポートされていません。

source: Injecting beans
ja_jp: Bean の注入

source: Injecting data sources
ja_jp: データソースの注入

source: Injecting entry points
ja_jp: エントリーポイントの注入

source: Injecting management URL in tests
ja_jp: テストに管理 URL を注入する

source: Injecting properties
ja_jp: プロパティーの注入

source: Injecting the Authorization Client
ja_jp: 認可クライアントのインジェクション

source: Injecting the Virtual Thread ExecutorService is experimental and may change in future versions.
ja_jp: Virtual Thread ExecutorService の注入は実験的なもので、将来のバージョンで変更される可能性があります。

source: Injecting the `EntityManager` of a named persistence unit (`users` in our example) is as simple as:
ja_jp: 名前付き永続化ユニット (この例では `users`) の `EntityManager` を注入するのは簡単です。

source: Injecting the `jakarta.ws.rs.ext.Providers` instance in filters
ja_jp: `jakarta.ws.rs.ext.Providers` インスタンスをフィルターに注入する

source: Injecting the authorization client
ja_jp: 認可クライアントの注入

source: Injecting the client for the default datasource does not require anything special.
ja_jp: デフォルトのデータソースにクライアントを挿入するために特別なことは何も必要ありません。

source: Injecting the command line arguments
ja_jp: コマンドライン引数の注入

source: Injection
ja_jp: インジェクション

source: Injection Discovery/Navigation
ja_jp: インジェクションディスカバリー/ナビゲーション

source: Injection fields are resolved as template locators annotated with `@Locate` are registered as singleton session beans.
ja_jp: 注入フィールドは `@Locate` でアノテーションされたテンプレートロケーターとして解決され、シングルトンセッション Bean として登録されます。

source: Injection into tests
ja_jp: テストへの注入

source: Injection is also supported into objects that implement `io.quarkus.test.common.DevServicesContext.ContextAware`. If you have a field that implements `io.quarkus.test.common.DevServicesContext.ContextAware` Quarkus will call the `setIntegrationTestContext` method to pass the context into this object. This allows client logic to be encapsulated in a utility class.
ja_jp: `io.quarkus.test.common.DevServicesContext.ContextAware` を実装するオブジェクトへの注入もサポートされています。 `io.quarkus.test.common.DevServicesContext.ContextAware` を実装するフィールドがある場合、Quarkus は ` setIntegrationTestContext` メソッドを呼び出して、コンテキストをこのオブジェクトに渡します。これにより、クライアントロジックをユーティリティークラスにカプセル化できます。

source: Injection is resolved at compile time via an annotation processor, and the resulting code does not have permission to inject private fields or invoke private methods.
ja_jp: インジェクションは、アノテーション・プロセッサを介してコンパイル時に解決され、生成されたコードは、プライベート・フィールドを注入したり、プライベート・メソッドを呼び出したりする権限を持ちません。

source: Injection itself does not result in the instantiation of `CoolService`. A client proxy is injected.
ja_jp: 注入自体は、 `CoolService` のインスタンス化にはなりません。クライアントプロキシーが注入されます。

source: Injection of CDI beans
ja_jp: CDI Bean のインジェクション

source: Injection of `@SessionScoped` beans
ja_jp: `@SessionScoped` Bean の注入

source: Injection of `JsonWebToken` is supported in `@ApplicationScoped`, `@Singleton` and `@RequestScoped` scopes however the use of `@RequestScoped` is required if the individual claims are injected as simple types, please see xref:security-jwt.adoc#supported-injection-scopes[Support Injection Scopes for JsonWebToken and Claims] for more details.
ja_jp: `JsonWebToken` の注入は、 `@ApplicationScoped`、 `@Singleton`、および `@RequestScoped` スコープでサポートされていますが、個々のクレームがシンプル型として注入される場合は、 `@RequestScoped` の使用が必要です。 xref:security-jwt を参照してください。詳細については、 xref:security-jwt.adoc#supported-injection-scopes[JsonWebToken およびクレームの注入スコープのサポート] を参照してください。

source: Injection of `JsonWebToken` is supported in `@ApplicationScoped`, `@Singleton`, and `@RequestScoped` scopes. However, the use of `@RequestScoped` is required if the individual claims are injected as simple types. For more information, see the xref:security-jwt.adoc#supported-injection-scopes[Supported injection scopes] section of the Quarkus "Using JWT RBAC" guide.
ja_jp: `JsonWebToken` の注入は、 `@ApplicationScoped`、 `@Singleton`、および `@RequestScoped` スコープでサポートされています。 ただし、個々のクレームが単純型として挿入される場合は、 `@RequestScoped` を使用する必要があります。 詳細は、Quarkus の「JWT RBAC の使用」ガイドの xref:security-jwt.adoc#supported-injection-scopes[サポートされている注入スコープ] セクションを参照してください。

source: Injection of resources into tests
ja_jp: テストへのリソースの注入

source: Injection of the `JsonWebToken` and `AccessTokenCredential` is supported in both `@RequestScoped` and `@ApplicationScoped` contexts.
ja_jp: `JsonWebToken` と `AccessTokenCredential` の注入は、 `@RequestScoped` と `@ApplicationScoped` の両方のコンテキストでサポートされています。

source: Injection of the `SecurityIdentity` is supported in both `@RequestScoped` and `@ApplicationScoped` contexts.
ja_jp: `SecurityIdentity` のインジェクションは、 `@RequestScoped` と `@ApplicationScoped` の両方のコンテキストでサポートされています。

source: Injection point metadata
ja_jp: 挿入点メタデータ

source: Injection triggers the instantiation of `AmazingService`.
ja_jp: 注入は、 `AmazingService` のインスタンス化をトリガーします。

source: Injection works inside your function.
ja_jp: インジェクションは Cloud Function 関数クラスの中で動作します。

source: Injects the `quotes` channel using the `@Channel` qualifier
ja_jp: `@Channel` 修飾子を使用して `quotes` のチャネルを注入します

source: Injects the only active datasource.
ja_jp: 唯一のアクティブなデータソースをインジェクトします。

source: Injects the only active persistence unit.
ja_jp: 唯一のアクティブな永続化ユニットを注入します。

source: Inlay hints
ja_jp: インレーのヒント

source: Inlay hints can be disabled in `Preferences | Languages & Frameworks | MicroProfile | Properties`
ja_jp: インレイヒントは `Preferences | Languages & Frameworks | MicroProfile | Properties`

source: Inner-signed and encrypted or encrypted tokens
ja_jp: 内部署名付き暗号化トークン、または暗号化トークン

source: InnerSigned/Encrypted or Encrypted tokens
ja_jp: InnerSigned/Encrypted もしくは Encrypted トークン

source: Input
ja_jp: 入力

source: Insert a blank line after all document attributes and before the abstract.
ja_jp: すべてのドキュメント属性の後、要約の前に空白行を挿入します。

source: Insert the title of the guide between double quotations and specify “guide” directly after the title.
ja_jp: ガイドのタイトルを二重引用符で囲み、タイトルの直後にガイドと指定します。

source: Inside a consumer group, as new group members arrive and old members leave, the partitions are re-assigned so that each member receives a proportional share of the partitions. This is known as rebalancing the group. To handle offset commit and assigned partitions yourself, you can provide a consumer rebalance listener. To achieve this, implement the `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` interface and expose it as a CDI bean with the `@Idenfier` qualifier. A common use case is to store offset in a separate data store to implement exactly-once semantic, or starting the processing at a specific offset.
ja_jp: コンシューマーグループ内では、新しいグループメンバーが到着し、古いメンバーが離れると、パーティションが再割り当てされ、各メンバーにパーティションが比例配分されます。これは、グループのリバランスとして知られています。オフセットコミットとパーティション割り当てを自分で処理するために、コンシューマーリバランスリスナーを提供することができます。これを実現するには、 `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` インターフェイスを実装し、 `@Idenfier` 修飾子を使用して CDI Bean として公開します。一般的な使用例として、オフセットを別のデータストアに格納して exactly-once セマンティックを実装したり、特定のオフセットで処理を開始したりすることが挙げられます。

source: Inside application configuration, channel names are unique. Therefore, if you'd like to configure an incoming and outgoing channel on the same topic, you will need to name channels differently (like in the examples of this guide, `mp.messaging.incoming.prices` and `mp.messaging.outgoing.prices-out`).
ja_jp: アプリケーション設定内では、チャネル名は一意です。したがって、同じトピックで着信チャネルと送信チャネルを設定する場合は、チャネルに異なる名前を付ける必要があります (たとえば、このガイドの例のように、 `mp.messaging.incoming.prices` と `mp.messaging.outgoing.prices-out` など)。

source: Inside each service’s subdirectory in the repository is a `+deploy/docker-compose+` directory containing the compose files for the four versions of the application. Multiple compose files can be combined into a single command.
ja_jp: リポジトリ内の各サービスのサブディレクトリの中には、4つのバージョンのアプリケーションのComposeファイルを含む `deploy/docker-compose` ディレクトリがあります。複数のComposeファイルを1つのコマンドにまとめることができます。

source: Inside methods annotated with `@Transactional` you can access the `ClientSession` with `Panache.getClientSession()` if needed.
ja_jp: `@Transactional` アノテーションが付けられたメソッド内では、必要に応じて `Panache.getClientSession()` を使用して `ClientSession` にアクセスできます。

source: Inside the _producer_ project, create the `src/main/java/org/acme/kafka/producer/QuotesResource.java` file and add the following content:
ja_jp: _プロデューサー_ プロジェクト内に、 `src/main/java/org/acme/kafka/producer/QuotesResource.java` ファイルを作成し、次のコンテンツを追加します。
